app/controllers/albums_controller.rb

SELECT * FROM `albums`
---
  def index
    @albums = Album.all

SELECT * FROM `albums` WHERE (`albums`.`id` = 6)
---
  def edit
    @album = Album.find(params[:id])