app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT * FROM `collections`