app/controllers/logins_controller.rb

  def create
		@signup = Signup.new(params[:userform])
		valid_user = Signup.find(:first,:conditions => ["email = ? and password = ?",@signup.email, @signup.password])
---
SELECT * FROM `signups` WHERE (email = 'pravinmishra88@gmail.com' and password = '12374') LIMIT 1